import numpy as np
import matplotlib.pyplot as plt

'''
print(data[0:10]) # 0-10
print(data[:20]) # 0-20
print(data[10:]) # 10-last
print(data[[1,3,5]]) # 1,3,5
print(data[data[:,4]==1]) # 第四個欄位為1
print(data[:, 0]) # 第0欄，全部列
print(data[:, [1,3]]) # 全部列，一三欄
'''

#--------------------------------------------------------------------------------------------
# 讀取鳶尾花資料
# 花萼長, 花萼寬, 花瓣長, 花瓣寬, 花種編號 (山鳶尾花:1, 變色鳶尾花:2, 維吉尼亞鳶尾花:3)
#--------------------------------------------------------------------------------------------
data=np.genfromtxt('iris.csv',  delimiter=',')

#---------------------------
# 圖形設定
#---------------------------
fig = plt.figure()
sub = fig.add_subplot(111) # (垂直、水平、第一塊)
# sub = fig.add_subplot(223) # (垂直切兩塊、水平切兩塊、第一塊)


#---------------------------
# 資料分割群
#---------------------------
data1 = data[data[:,4]==1]
data2 = data[data[:,4]==2]
data3 = data[data[:,4]==3]

#---------------------------
# 繪製資料
#---------------------------
sub.plot(data1[:, 2], data1[:,3], 'bd', alpha=0.2)
sub.plot(data2[:, 2], data2[:,3], 'ro', alpha=0.2)
sub.plot(data3[:, 2], data3[:,3], 'g^', alpha=0.2)

#---------------------------
# 設定圖標題
#---------------------------
plt.title('Iris flower')

#---------------------------
# 設定資料說明
#---------------------------
plt.legend(['setosa', 'versicolor', 'virginica'], numpoints=1, loc='upper left')

#---------------------------
# 設定格線
#---------------------------
plt.grid(True)

#---------------------------
# 顯示圖形
#---------------------------
plt.show()